import { Container, Link } from "@mui/material";
import { Helmet } from "react-helmet-async";

const About = () => {
  return (
    <>
      <Helmet>
        <title>Про сервіс</title>
      </Helmet>
      <main>
        <Container>
          <div>
            <h2>Сервіс порівняння цін та характеристик товарів</h2>
            <p>
              Цей сервіс було розроблено для спрощення життя пересічним
              користувачам. Досить часто інтернет магазини маніпулють цінами,
              свторючи так звані "розпродажі", спершу піднявши ціну, а згодом її
              опустивши. Це недоброчесний маркетинговий хід, яикй змушує людей
              робити нераціональний вибір.
            </p>
            <p>
              Натомість, скориставшись нашим сервісом, ви можете одержати
              відповідь на наступні питання:
              <ul>
                <li>Який товар обрати?</li>
                <li>У якого товару кращі характеристики?</li>
                <li>У якому магазині найвигідніша пропозиція?</li>
                <li>Чи справді "знижка" є знижкою?</li>
                <li>
                  Як змінювалась ціна на товар протягом певного проміжку часу?
                </li>
              </ul>
            </p>
          </div>
          <div>
            <h2>Як додати новий магазин до переліку?</h2>
            <p>
              У нас немає жодних комісій чи платежів за додавання вашого
              магазину як джерела цін. Ми вважаємо, що усі інформкація в мережі
              Інтернет повинна бути відкритою абсолютно для всіх. Саме тому наш
              сервіс це open-source проект, і кожен може зробити цей сервіс дещо
              кращим. І додавши ваш магазин до нашої системи, ви гарантовано
              зробите кращим і цей сервіс, і життя усіх людей, яким цікаво
              купувати товари за вигідними цінами
            </p>
            <p>
              Детальну інформацію як це зробити ви можете знайти у відкритому
              репозиторії проекту:&nbsp;
              <Link
                href="https://github.com/OlehIlchyshyn/diploma-frontend"
                alt="frontend-repository"
                target="_black"
                style={{ textDecoration: "none" }}
              >
                Fetch product data [Frontend] - Github&nbsp;
              </Link>
              та&nbsp;
              <Link
                href="https://github.com/OlehIlchyshyn/diploma-backend"
                alt="backend-repository"
                target="_black"
                style={{ textDecoration: "none" }}
              >
                Fetch product data [Backend] - Github&nbsp;
              </Link>
            </p>
          </div>
        </Container>
      </main>
    </>
  );
};

export default About;
